DataProcessors/УправлениеРабочимСтолом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>УправлениеРабочимСтолом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыРабочихСтолов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыРабочихСтолов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальныйРабочийСтол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоризонтальныйРабочийСтол</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтараяНачальнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочийСтолДиспетчера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеВзаимодействиями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочийСтлоПаспортиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтолСправок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/УправлениеРабочимСтолом/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Картинка1 = БиблиотекаКартинок.НачальныйРабочийСтол;
	Картинка2 = БиблиотекаКартинок.РабочийСтолРассчетчика;
	Картинка3 = БиблиотекаКартинок.СтарыйСтол;
	Картинка4 = БиблиотекаКартинок.СтолДиспетчера;
	Картинка5 = БиблиотекаКартинок.УправлениеВзаимодействиями;
	Картинка6 = БиблиотекаКартинок.РСПаспортиста;
	Картинка7 = БиблиотекаКартинок.СтолСправок;
КонецПроцедуры

&НаСервере
 Процедура УстановитьрабочийСтолСервер(ТипСтола)
	 УстановитьПривилегированныйРежим(Истина);

	 Если ТипСтола = "НачальныйРабочийСтол" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.НачальныйРабочийСтол;
	 ИначеЕсли  ТипСтола = "ГоризонтальныйРабочийСтол" Тогда
		 ВидРабочегоСтола  = Перечисления.ВидыРабочихСтолов.ГоризонтальныйРабочийСтол;
	 ИначеЕсли ТипСтола =  "СтараяНачальнаяФорма" Тогда 
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтараяНачальнаяФорма;
	 ИначеЕсли ТипСтола =  "РабочийСтолДиспетчера" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтолДиспетчера;
	 ИначеЕсли ТипСтола =  "УправлениеВзаимодействиями" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.УправлениеВзаимодействиями;
	 ИначеЕсли ТипСтола =  "СтолПаспортиста" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.РабочийСтлоПаспортиста;
	 ИначеЕсли ТипСтола = "СтолСправок" Тогда
		 ВидРабочегоСтола = Перечисления.ВидыРабочихСтолов.СтолСправок;
	 КонецЕсли;
	 		 
 	 РС_СменитьСтол.СменитьСтол(ВидРабочегоСтола);
     УстановитьПривилегированныйРежим(Ложь);

 КонецПроцедуры // УстановитьрабочийСтолСервер(ТипСтола)()

//Обработчики команд
&НаКлиенте
Процедура УстановитьНачальныйРабочийСтол(Команда)
	
	УстановитьрабочийСтолСервер("НачальныйРабочийСтол");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРабочийСтолРасчетчика(Команда)
	УстановитьрабочийСтолСервер("ГоризонтальныйРабочийСтол");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтарыйРабочийСтол(Команда)
	УстановитьрабочийСтолСервер("СтараяНачальнаяФорма");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРабочийСтолДиспетчера(Команда)
	УстановитьрабочийСтолСервер("РабочийСтолДиспетчера");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУправлениеВзаимодействиями(Команда)
	
	УстановитьрабочийСтолСервер("УправлениеВзаимодействиями");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтолСправок(Команда)
	УстановитьрабочийСтолСервер("СтолСправок");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
КонецПроцедуры

&НаКлиенте
 Процедура УстановитьРабочийСтолПаспортиста(Команда)
	 
	УстановитьрабочийСтолСервер("СтолПаспортиста");
	ОСМДКлиент.ПолучитьПараметрыФункциональныхОпций();
	Форма = ЭтаФорма;
	Форма.Закрыть();
	
КонецПроцедуры
